## История олимпийских игр

Данные содержат следующие признаки:

* ID - Unique number for each athlete
* Name - Athlete's name
* Sex - M or F
* Age - Integer
* Height - In centimeters
* Weight - In kilograms
* Team - Team name
* NOC - National Olympic Committee 3-letter code
* Games - Year and season
* Year - Integer
* Season - Summer or Winter
* City - Host city
* Sport - Sport
* Event - Event
* Medal - Gold, Silver, Bronze, or NA

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('athlete_events.csv')
data.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

**1. Сколько лет было самым молодым участникам (мужчина и женщина) олимпийских игр в 1992 году?**

In [5]:
data[data['Year']==1992].groupby('Sex').min()

#d.groupby('region')[['total']].mean()

C:\Users\elgol\AppData\Local\Temp\ipykernel_12404\4262056346.py:1: FutureWarning: Dropping invalid columns in DataFrameGroupBy.min is deprecated. In a future version, a TypeError will be raised. Before calling .min, select only columns which should be valid for the function.
  data[data['Year']==1992].groupby('Sex').min()

,ID,Name,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event
Sex,,,,,,,,,,,,,
F,5,Aadjijatmiko Finarsih H.,12.0,136.0,30.0,Albania,AHO,1992 Summer,1992,Summer,Albertville,Alpine Skiing,Alpine Skiing Women's Combined
M,1,A Dijiang,11.0,140.0,45.0,Albania,AHO,1992 Summer,1992,Summer,Albertville,Alpine Skiing,Alpine Skiing Men's Combined

__2. Найдите среднее для роста теннисисток (большой теннис), которые участвовали в играх 2000 года.__

In [16]:
data[(data['Year']==2000) & (data['Sex']== 'F')].mean()

C:\Users\elgol\AppData\Local\Temp\ipykernel_12404\1646558600.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data[(data['Year']==2000) & (data['Sex']== 'F')].mean()

ID        70062.894495
Age          24.483057
Height      168.972903
Weight       60.811676
Year       2000.000000
dtype: float64

__3. Выведите названия всех уникальных дисциплин, связанных с катанием на коньках (Skating). Посчитайте их количество__

In [49]:
print(data[data['Sport'].str.contains('Skating')]['Sport'].unique())

['Speed Skating' 'Figure Skating' 'Short Track Speed Skating']

In [50]:
len(data[data['Sport'].str.contains('Skating')]['Sport'].unique())

3

__4. Выведите всех спортсменов, которые завоевали серебрянные медали в Париже. Посчитайте их количество__

In [56]:
data[(data['City'] == 'Paris') & (data['Medal'] == 'Silver')]['Name']

663                Max "Xam" Abegglen
917           Harold Maurice Abrahams
2403                   Anselm Ahlfors
2637                     Franz Aigner
4017                   Auguste Albert
                     ...
261463             Frank Henry Wilson
262731            William "Bill" Wood
263619    Paul H. (-Paul Knuth) Wyatt
265263              Jack Butler Yeats
271010                  Anton Zwerina
Name: Name, Length: 509, dtype: object

In [55]:
data[(data['City'] == 'Paris') & (data['Medal'] == 'Silver')]['Name'].count()

509

__5. Найдите самую легкую (по весу) атлетку игр 2006 года. В каком виде спорта она участвовала?__

In [75]:
data[(data['Year'] == 2006)][['Year', 'Name', 'Weight', 'Sport']].sort_values(by=['Weight']).head(1)

        Year             Name  Weight           Sport
188177  2006  Phyo Yong-Myong    38.0  Figure Skating

__6. В скольких олимпиадах принимал участие John Aalberg?__

In [85]:
data[(data['Name'] == 'John Aalberg')]['Games'].unique()

array(['1992 Winter', '1994 Winter'], dtype=object)

In [86]:
len(data[(data['Name'] == 'John Aalberg')]['Games'].unique())

2

__7. Сколько золотых медалей настольном теннисе выиграл Китай на Олимпиаде в 2008 году?__

In [100]:
data[(data['Team'] == 'China') & (data['Year'] == 2008) & (data['Medal'] == 'Gold')][['Medal']].count()

Medal    72
dtype: int64

In [106]:
data[(data['Team'] == 'China') & (data['Year'] == 2008) & (data['Medal'].isna() == False)].groupby('Medal').count()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event
Medal,,,,,,,,,,,,,,
Bronze,49,49,49,49,49,49,49,49,49,49,49,49,49,49
Gold,72,72,72,72,72,72,72,72,72,72,72,72,72,72
Silver,49,49,49,49,49,49,49,49,49,49,49,49,49,49

__8. Правда ли, что Испания выиграла меньше медалей чем Италия на играх 2016 года? Не учитывайте NaN в колонке _Medal_.__

In [110]:
data[((data['Team'] == 'China') | (data['Team'] == 'Italy')) & (data['Year'] == 2016) & da].groupby('Team').count()

,ID,Name,Sex,Age,Height,Weight,NOC,Games,Year,Season,City,Sport,Event,Medal
Team,,,,,,,,,,,,,,
China,109,109,109,109,109,109,109,109,109,109,109,109,109,109
Italy,70,70,70,70,70,70,70,70,70,70,70,70,70,70

__9. Какая страна завоевала больше всех медалей в Figure Skating за всю историю?__

In [128]:
data[(data['Medal'].isna()== False) & (data['Sport'] == 'Figure Skating')].groupby('Team').count().sort_values(by = 'Medal', ascending = False).head(1)

,ID,Name,Sex,Age,Height,Weight,NOC,Games,Year,Season,City,Sport,Event,Medal
Team,,,,,,,,,,,,,,
United States,46,46,46,46,29,28,46,46,46,46,46,46,46,46